ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV197/ESP32_WordClockV197.ino
    case 'S':                                                                                 // Slope factor for brightness
      if(len > 1 && len < 5) 
       {
        Mem.LightReducer = (byte)SConstrainInt(InputString, 1, 1, 255);
        snprintf(sptext, sizeof(sptext), "Slope brightness changed to: %d%%", Mem.LightReducer);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Input fault. \nEnter Snnn where n between 1 and 255");
      break;
      
    case 'T':                                                                                 // Time setting
      if(len == 7) 
       {
        timeinfo.tm_hour = (int)SConstrainInt(InputString, 1, 3, 0, 23);
        timeinfo.tm_min  = (int)SConstrainInt(InputString, 3, 5, 0, 59);
        timeinfo.tm_sec  = (int)SConstrainInt(InputString, 5, 7, 0, 59);
        if(DS3231Installed)   SetDS3231Time();
        else snprintf(sptext, sizeof(sptext), "No external RTC module detected");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter Thhmmss ****");
      break;
      
    case 'U':                                                                                 // Demo mode
      if(len == 1) 
      { 
        if(Demo)  {   lastminute = 99;  Demo = false; }                                       // Force a minute update and turn off demo mode
        else { MilliSecondValue = 200;  Demo = true;  }                                       // If Demomode was off turn it on with 200 msec delay 
        snprintf(sptext, sizeof(sptext), "Demo mode: %s, %d msec/min", Demo ? "ON" : "OFF", MilliSecondValue);    
       } 
      else if(len > 1 && len < 6) 
       {
        MilliSecondValue = InputString.substring(1, 5).toInt();
        Demo = true;
        snprintf(sptext, sizeof(sptext), "Demo mode: %s, %d msec/min", Demo ? "ON" : "OFF", MilliSecondValue);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault U. Demo mode (Unnn or U) ****");
      break;

    case 'V':  
      if (len == 9) 
         {                                                                                    // Hexadecimal number input (00 - FF per colour) 
          String HexPart = InputString.substring(1, 9);
          Mem.DimmedLetter = strtoul(HexPart.c_str(), nullptr, 16);
         }
       else 
         {
          snprintf(sptext, sizeof(sptext),"Enter Vwwrrggbb hexadecimal (0 - F)\nDimmed colour Stored: 0X%08" PRIX32, Mem.DimmedLetter);
          break;
         }
      snprintf(sptext, sizeof(sptext), "**** Dimmed font colour changed ****\nColour now: 0X%08" PRIX32, Mem.DimmedLetter);
      Tekstprintln(sptext);
      LedsOff();                                                                              // Clear the display
      SetSecondColour();                                                                      // Set the colour per second of 'IS' and 'WAS' 
      Displaytime();Tekstprintln("");
      sptext[0]=0;                                                                            // Suppress a second print of sptext
      break;

    case 'W':                                                                                 // WIFI toggle
      if(len == 1) 
       {
        Mem.WIFIOn = 1 - Mem.WIFIOn;
        Mem.NTPOn = Mem.WIFIOn;                                                               // If WIFI is off turn NTP also off
        snprintf(sptext, sizeof(sptext), "WIFI is %s after restart", Mem.WIFIOn ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter W ****");
      break;
      
    case 'X':                                                                                 // NTP toggle
      if(len == 1) 
       {
        Mem.NTPOn = 1 - Mem.NTPOn;
        snprintf(sptext, sizeof(sptext), "NTP is %s after restart", Mem.NTPOn ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter X ****");
      break;
      
    case 'Y':                                                                                 // LEDtest
      if(len == 1) 
       {
        LEDtest();
        lastminute = 99;                                                                        // Force a minute update
        snprintf(sptext, sizeof(sptext), "**** LED test");
       }
      break;
      
    case 'Z':                                                                                 // Start WPS
      if(len == 1) 
       {
        snprintf(sptext, sizeof(sptext), "**** Start WPS on your router");
        WiFi.onEvent(WiFiEvent);
        WiFi.mode(WIFI_STA);
        Tekstprintln("Starting WPS");
        wpsInitConfig();
        wpsStart();
       }
      break;
      
    case '!':                                                                                 // Print times
      if(len == 1) PrintAllClockTimes();
      sprintf(sptext,"\n");
      break;
      
    case '@':                                                                                 // Reset ESP
      if(len == 1) 
       {
        Mem.MCUrestarted = 0;                                                                 // Reset MCUrestart counter to 0    
        Tekstprintlnf("Mem.MCUrestarted reset to 0");
        StoreStructInFlashMemory();
        Tekstprintln("\n*********\n ESP restarting\n*********\n");            
        ESP.restart();
       } 
      else sprintf(sptext, "**** Length fault. Enter @ ****");
      break;
      
    case '#':                                                                                 // Self test
      if(len == 1) 
       {
        Zelftest = 1 - Zelftest;
        snprintf(sptext, sizeof(sptext), "Zelftest: %s", Zelftest ? "ON" : "OFF");
        Selftest();
        Displaytime(); Tekstprintln("");
       } 
      else if(len > 1 && len < 6) 
       {
        MilliSecondValue = InputString.substring(1, 5).toInt();
        Zelftest = 1 - Zelftest;
        snprintf(sptext, sizeof(sptext), "Zelftest: %s", Zelftest ? "ON" : "OFF");
        Selftest(MilliSecondValue);
        Displaytime(); Tekstprintln("");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault #. Demo mode (#nnnn or #) ****");
      break;
      
